[
  {
    "id": "1",
    "title": "Birth of Prophet Muhammad ﷺ",
    "year": 571,
    "location": "Mecca, Saudi Arabia (Kaaba)",
    "coordinates": [21.422487, 39.826206],
    "description": "Birth of Prophet Muhammad (peace be upon him) in Mecca, traditionally dated to Rabi' al-Awwal.",
    "significance": "Marks the birth of the final Prophet in Islam.",
    "category": "religious",
    "image": "/images/optimized_birth.png",
    "detailedDescription": "According to many traditional sources the Prophet was born in Mecca in the Year of the Elephant. He was born into the Quraysh clan of Banu Hashim and later was placed with a foster family in the deserts of Najd for some years."
  },
  {
    "id": "2",
    "title": "Return from Foster Mother to Mother",
    "year": 574,
    "location": "Mecca, Saudi Arabia",
    "coordinates": [21.422487, 39.826206],
    "description": "Young Muhammad returned to his mother Amina in Mecca after being fostered in the desert.",
    "significance": "End of the customary nursing/foster period common in Arabian society.",
    "category": "personal",
    "image": "/images/optimized_return_from_foster.png",
    "detailedDescription": "After spending early years with his wet nurse Halima, the child returned to his mother in Mecca."
  },
  {
    "id": "3",
    "title": "Death of Mother Amina",
    "year": 575,
    "location": "Abwa, on the road between Mecca and Medina",
    "coordinates": [21.3083, 39.9833],
    "description": "Amina bint Wahb, the Prophet's mother, died at Abwa while returning from a visit to Medina.",
    "significance": "Muhammad became an orphan at a young age and came under the care of his grandfather.",
    "category": "personal",
    "image": "/images/optimized_abwa.png",
    "detailedDescription": "Amina died when Muhammad was a young child during the return trip from Medina. He was subsequently cared for by his grandfather Abdul-Muttalib. Coordinates represent the historic Abwa area on the Mecca–Medina route."
  },
  {
    "id": "4",
    "title": "Death of Grandfather Abdul-Muttalib",
    "year": 577,
    "location": "Mecca, Saudi Arabia",
    "coordinates": [21.422487, 39.826206],
    "description": "After the death of Abdul-Muttalib, custody passed to the Prophet's uncle Abu Talib.",
    "significance": "Muhammad's guardianship moved to Abu Talib, shaping his youth and trade career.",
    "category": "personal",
    "image": "/images/optimized_abdul_muttalib_death.png",
    "detailedDescription": "Abdul-Muttalib served as protector of the family and the Kaaba prior to his death."
  },
  {
    "id": "5",
    "title": "First Syrian Trade Journey",
    "year": 578,
    "location": "Syria (Byzantine provinces) - Busra mentioned in later trips",
    "coordinates": [32.5175, 36.4928],
    "description": "Early trade journey to the Levant with his uncle Abu Talib.",
    "significance": "Exposed the young Muhammad to wider cultures and trade routes.",
    "category": "personal",
    "image": "/images/optimized_syria_trip.png",
    "detailedDescription": "Traditional accounts mention journeys to the Levant in youth. Busra (Bostra) is the commonly cited destination for some of these early caravans."
  },
  {
    "id": "6",
    "title": "Participation in the Fijar Wars and Hilf al-Fudul",
    "year": 589,
    "location": "Mecca region, Arabian Peninsula",
    "coordinates": [21.422487, 39.826206],
    "description": "Participation in pre-Islamic conflicts and in the Hilf al-Fudul (Pact of the Virtuous).",
    "significance": "Early demonstrations of moral leadership and protection of the weak.",
    "category": "political",
    "image": "/images/optimized_fijar_hilf.png",
    "detailedDescription": "The Prophet took part in inter-tribal conflicts as a youth and later joined the Hilf al-Fudul, an agreement among Meccan notables to uphold justice."
  },
  {
    "id": "7",
    "title": "Marriage to Khadija bint Khuwaylid",
    "year": 594,
    "location": "Mecca, Saudi Arabia",
    "coordinates": [21.422487, 39.826206],
    "description": "Muhammad married Khadija, a prosperous Meccan merchant.",
    "significance": "The marriage provided social and financial stability and support during the early prophethood.",
    "category": "personal",
    "image": "/images/optimized_marriage_khadija.png",
    "detailedDescription": "Khadija was the Prophet's first and most supportive wife. Their marriage preceded the start of revelation."
  },
  {
    "id": "8",
    "title": "Arbitration over the Black Stone (Hajar al-Aswad)",
    "year": 605,
    "location": "Kaaba, Mecca",
    "coordinates": [21.422487, 39.826206],
    "description": "Muhammad acted as arbiter during the rebuilding of the Kaaba and placed the Black Stone.",
    "significance": "Event noted as an example of his wisdom and respected standing among Quraysh.",
    "category": "political",
  "image": "/images/optimized_8.png",
    "detailedDescription": "During the Kaaba repair, rival clans argued over who would set the stone. Muhammad proposed placing it on a cloth and having a representative from each clan carry it together, then he placed it himself."
  },
  {
    "id": "9",
    "title": "First Revelation at Hira",
    "year": 610,
    "location": "Jabal al-Nour (Hira cave), near Mecca",
    "coordinates": [21.6243, 39.8744],
    "description": "The angel Gabriel delivered the first verses of the Qur'an (Surah Al-'Alaq).",
    "significance": "Marks the beginning of Muhammad's prophethood and the Islamic message.",
    "category": "religious",
  "image": "/images/optimized_9.png",
    "detailedDescription": "Muhammad received the initial revelation in the cave of Hira while engaged in spiritual retreat. This event launched the mission of prophethood."
  },
  {
    "id": "10",
    "title": "Public Preaching and the Invitation of Close Kin",
    "year": 613,
    "location": "Mecca",
    "coordinates": [21.422487, 39.826206],
    "description": "The Prophet began publicly calling people to Islam and invited his relatives.",
    "significance": "The message moved from private to public propagation, increasing opposition from Quraysh.",
    "category": "religious",
  "image": "/images/optimized_10.png",
    "detailedDescription": "After several years of private preaching, the command to invite people openly led to greater conversions and also increased persecution."
  },
  {
    "id": "11",
    "title": "Persecution Intensifies and First Migration to Abyssinia",
    "year": 615,
    "location": "Abyssinia (Aksum region), Ethiopia",
    "coordinates": [14.1217, 38.7246],
    "description": "Some early Muslims sought refuge in the Christian kingdom of Aksum.",
    "significance": "First example of a Muslim community fleeing persecution by migrating abroad.",
    "category": "political",
  "image": "/images/optimized_11.png",
    "detailedDescription": "The migration to Aksum offered protection under the Christian ruler (Negus) and became an important early refuge for persecuted Muslims."
  },
  {
    "id": "12",
    "title": "Second Migration to Abyssinia and Key Conversions",
    "year": 616,
    "location": "Aksum region, Abyssinia (Ethiopia)",
    "coordinates": [14.1217, 38.7246],
    "description": "A second group migrated and notable conversions in Mecca (Hamza, Umar) occurred around this period.",
    "significance": "Strengthened the early Muslim community and notable figures embraced Islam.",
    "category": "religious",
  "image": "/images/optimized_12.png",
    "detailedDescription": "The persecutions in Mecca prompted another migration. Around the same period Hamza and Umar converted, changing the balance of power within the city."
  },
  {
    "id": "13",
    "title": "Economic and Social Boycott of Banu Hashim",
    "year": 616,
    "location": "Mecca",
    "coordinates": [21.422487, 39.826206],
    "description": "Meccan tribes imposed a social and economic boycott on the Prophet's clan.",
    "significance": "Intensified hardship for the early Muslim community; later lifted.",
    "category": "political",
  "image": "/images/optimized_13.png",
    "detailedDescription": "The boycott forced the believers into a restricted enclave in Mecca. It lasted several years until its termination around 619."
  },
  {
    "id": "14",
    "title": "End of the Boycott",
    "year": 619,
    "location": "Mecca",
    "coordinates": [21.422487, 39.826206],
    "description": "The Qurayshi-enforced boycott was lifted, easing pressure on the Muslim community.",
    "significance": "Relief for the Muslims and a turning point before the Year of Sorrow.",
    "category": "political",
  "image": "/images/optimized_14.png",
    "detailedDescription": "The end of the economic and social sanctions allowed more freedom of movement for the Prophet and his followers."
  },
  {
    "id": "15",
    "title": "Year of Sorrow: Deaths of Khadija and Abu Talib",
    "year": 620,
    "location": "Mecca",
    "coordinates": [21.422487, 39.826206],
    "description": "Loss of two primary supporters: wife Khadija and uncle Abu Talib.",
    "significance": "Left the Prophet politically vulnerable and personally bereaved.",
    "category": "personal",
  "image": "/images/optimized_15.png",
    "detailedDescription": "These deaths deeply affected the Prophet and the Muslim community. The period is termed 'Am al-Huzn' (Year of Sorrow)."
  },
  {
    "id": "16",
    "title": "Pledges at Aqaba (First and Second) and Mission to Medina",
    "year": 621,
    "location": "Aqaba (near Medina), Hejaz",
    "coordinates": [24.4922, 39.6111],
    "description": "Delegations from Yathrib (Medina) pledged support. Mus'ab ibn Umayr was sent to teach in Medina.",
    "significance": "Laid the groundwork for the Prophet's migration and the foundation of the Medinan community.",
    "category": "political",
  "image": "/images/optimized_16.png",
    "detailedDescription": "The pledges (bi'at) at Aqaba were pivotal steps toward the Hijra and the establishment of a Muslim polity in Medina."
  },
  {
    "id": "17",
    "title": "Isra and Mi'raj (Night Journey and Ascension)",
    "year": 621,
    "location": "From Masjid al-Haram (Mecca) to Al-Aqsa (Jerusalem) and the Heavens",
    "coordinates": [31.7767, 35.2345],
    "description": "The miraculous night journey and ascension; five daily prayers ordained.",
    "significance": "A foundational spiritual event with liturgical consequences for Muslims.",
    "category": "religious",
  "image": "/images/optimized_17.png",
    "detailedDescription": "Tradition relates that the Prophet was taken in one night from Mecca to Jerusalem and then ascended through the heavens. The event established the ritual of five daily prayers."
  },
  {
    "id": "18",
    "title": "Hijra: Migration to Medina",
    "year": 622,
    "location": "From Mecca to Medina (arrival in Quba and settlement in Medina)",
    "coordinates": [24.467035, 39.610947],
    "description": "The Prophet and companions migrated to Yathrib (Medina). The first mosque (Quba) was built and the Prophet later settled in the city.",
    "significance": "Beginning of the Islamic calendar and establishment of the first Islamic state.",
    "category": "political",
  "image": "/images/optimized_18.png",
    "detailedDescription": "Fleeing an assassination plot in Mecca the Prophet took refuge in the Cave of Thawr before proceeding to Quba and then Medina, where the Muslim community and mosque were established."
  },
  {
    "id": "19",
    "title": "Constitution of Medina and Brotherhood Between Muhajirun and Ansar",
    "year": 623,
    "location": "Medina",
    "coordinates": [24.467035, 39.610947],
    "description": "Establishment of the Medinan charter and the mutual brotherhood between migrants and helpers.",
    "significance": "Created a multi-tribal polity with collective obligations and rights.",
    "category": "political",
  "image": "/images/optimized_19.png",
    "detailedDescription": "The Medina Charter organized relations between Muslims, Jews, and other groups and set the basis for governance in the new Muslim state."
  },
  {
    "id": "20",
    "title": "Change of Qibla to the Kaaba",
    "year": 624,
    "location": "Medina (prayer direction changed to Mecca)",
    "coordinates": [24.467035, 39.610947],
    "description": "Prayer direction changed from Jerusalem to the Kaaba in Mecca.",
    "significance": "A major liturgical reorientation for the Muslim community.",
    "category": "religious",
  "image": "/images/optimized_20.png",
    "detailedDescription": "The Prophet received revelation directing Muslims to face the Kaaba in Mecca for prayer."
  },
  {
    "id": "21",
    "title": "Battle of Badr",
    "year": 624,
    "location": "Badr, Hejaz",
    "coordinates": [23.7333, 38.7667],
    "description": "Major victory for the Muslims against the Quraysh of Mecca.",
    "significance": "Consolidated the position of the Medinan community and had major political consequences.",
    "category": "battle",
  "image": "/images/optimized_21.png",
    "detailedDescription": "The Muslim force under the Prophet defeated a larger Meccan army at Badr."
  },
  {
    "id": "22",
    "title": "Battle of Uhud",
    "year": 625,
    "location": "Mount Uhud, near Medina",
    "coordinates": [24.521255, 39.626253],
    "description": "The Muslims faced Meccan forces; it resulted in heavy Muslim casualties and the martyrdom of Hamza.",
    "significance": "A sobering reversal that tested the Medinan community.",
    "category": "battle",
  "image": "/images/optimized_22.png",
    "detailedDescription": "The battle followed strategic errors among Muslim ranks leading to losses despite initial successes."
  },
  {
    "id": "23",
    "title": "Battle of the Trench (Ahzab) and Battle with Banu Qurayza",
    "year": 627,
    "location": "Medina (Trench around Medina and Banu Qurayza area)",
    "coordinates": [24.467035, 39.610947],
    "description": "A coalition besieged Medina; the trench defense repelled them. Later Banu Qurayza were judged for treason.",
    "significance": "Defensive success that secured Medina and removed an internal threat.",
    "category": "battle",
  "image": "/images/optimized_23.png",
    "detailedDescription": "The trench (khandaq) dug around Medina prevented a decisive siege. Subsequent action against Banu Qurayza addressed perceived treachery."
  },
  {
    "id": "24",
    "title": "Treaty of Hudaybiyyah and Bay'at al-Ridwan",
    "year": 628,
    "location": "Al-Hudaybiyyah (near Mecca)",
    "coordinates": [21.4450, 39.0833],
    "description": "A truce with Quraysh and later the pledge of satisfaction after the crisis involving Uthman.",
    "significance": "Paved the way for wider acceptance of Islam and later peaceful entries into Mecca.",
    "category": "political",
  "image": "/images/optimized_24.png",
    "detailedDescription": "The treaty temporarily recognized peace and allowed Muslim diplomacy to expand. The Bay'at al-Ridwan followed the news of Uthman's detention and produced a solemn pledge."
  },
  {
    "id": "25",
    "title": "Battle of Mu'tah",
    "year": 629,
    "location": "Mu'tah (modern-day Jordan)",
    "coordinates": [31.100, 35.700],
    "description": "Encounter with Byzantine-allied forces; a large campaign on the frontier.",
    "significance": "Early engagement with Byzantine sphere and expansion of Muslim military reach.",
    "category": "battle",
  "image": "/images/optimized_25.png",
    "detailedDescription": "The Muslim contingent faced strong resistance. The campaign demonstrated the growing regional role of the Muslim polity."
  },
  {
    "id": "26",
    "title": "Conquest of Mecca",
    "year": 630,
    "location": "Mecca",
    "coordinates": [21.422487, 39.826206],
    "description": "Peaceful entry and submission of Mecca to the Prophet and Islam.",
    "significance": "A major turning point leading to the consolidation of Islam across Arabia.",
    "category": "political",
  "image": "/images/optimized_26.png",
    "detailedDescription": "The Prophet entered Mecca with a large force; few battles occurred as many surrendered and the Kaaba was purified of idols."
  },
  {
    "id": "27",
    "title": "Battle of Hunayn",
    "year": 630,
    "location": "Hunayn valley (between Mecca and Ta'if)",
    "coordinates": [21.5000, 40.0000],
    "description": "Battle against Hawazin and Thaqif after the conquest of Mecca.",
    "significance": "Tested the new Muslim state's ability to integrate and manage tribal resistance.",
    "category": "battle",
  "image": "/images/optimized_27.png",
    "detailedDescription": "Despite initial setbacks the Muslim forces prevailed and large spoils were taken."
  },
  {
    "id": "28",
    "title": "Siege of Ta'if",
    "year": 630,
    "location": "Ta'if, Hejaz",
    "coordinates": [21.437273, 40.512714],
    "description": "Campaign against the city of Ta'if following the conquest of Mecca.",
    "significance": "Ta'if resisted but later many of its inhabitants embraced Islam.",
    "category": "battle",
  "image": "/images/optimized_28.png",
    "detailedDescription": "The siege did not immediately result in capitulation but political influence increased over time."
  },
  {
    "id": "29",
    "title": "Tabuk Expedition",
    "year": 630,
    "location": "Tabuk (northwestern Arabia)",
    "coordinates": [28.390409, 36.573200],
    "description": "A major northern expedition toward the Byzantine frontier; no large battle occurred.",
    "significance": "Demonstrated the logistical reach and diplomatic influence of the Muslim polity.",
    "category": "political",
  "image": "/images/optimized_29.png",
    "detailedDescription": "The Prophet led a sizable army to Tabuk in response to reports of a Byzantine threat. The campaign ended largely through diplomacy and submission of local tribes."
  },
  {
    "id": "30",
    "title": "Year of Delegations and Consolidation",
    "year": 631,
    "location": "Various (Arabia)",
    "coordinates": [24.467035, 39.610947],
    "description": "Many tribal delegations came to the Prophet and many accepted Islam.",
    "significance": "Marked the rapid expansion of Islam across Arabia through diplomacy and conversion.",
    "category": "political",
  "image": "/images/optimized_30.png",
    "detailedDescription": "The year is noted for the arrival of numerous envoys and leaders seeking to submit to Islam, often termed the Year of Deputations."
  },
  {
    "id": "31",
    "title": "Farewell Pilgrimage (Hajj) and Farewell Sermon",
    "year": 632,
    "location": "Arafat and Mecca",
    "coordinates": [21.422487, 39.826206],
    "description": "The Prophet performed the Farewell Hajj and delivered the Farewell Sermon.",
    "significance": "Summarized key ethical and legal principles for the Muslim community.",
    "category": "religious",
  "image": "/images/optimized_31.png",
    "detailedDescription": "The Farewell Sermon articulated core principles including equality, rights, and obligations among believers."
  },
  {
    "id": "32",
    "title": "Death of Prophet Muhammad ﷺ",
    "year": 632,
    "location": "Medina, Saudi Arabia",
    "coordinates": [24.467035, 39.610947],
    "description": "The passing of the Prophet and his burial in Medina.",
    "significance": "Marked the end of prophetic revelation and the beginning of the caliphal era.",
    "category": "personal",
  "image": "/images/optimized_32.png",
    "detailedDescription": "The Prophet died in Medina and was buried in the chamber of Aisha adjacent to the Prophet's Mosque. His death had profound religious and political consequences for the Muslim community."
  }
]